kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
#include <stdbool.h>
#include <stdint.h>

#include "FreeRTOS.h"
#include "../sensors/sensor_manager.h"
#include "board_a_log_schedule.h"
#include "board_a_monotonic.h"
#include "board_a_persistence_tasks.h"
#include "board_a_rx_recovery.h"
#include "board_a_runtime.h"
#include "board_a_tx.h"
#include "config.h"
#include "debug_uart.h"
#include "delay.h"
#include "queue.h"
#include "semphr.h"
#include "soft_i2c.h"
#include "stm32f4xx.h"
#include "task.h"

#define BOARD_A_RS485_BAUD 9600U
#define BOARD_A_T35_US 4011U
#define BOARD_A_RX_QUEUE_CAPACITY 512U
#define BOARD_A_COMM_TASK_PRIORITY 3U
#define BOARD_A_ACQUISITION_TASK_PRIORITY 4U
#define BOARD_A_COMM_STACK_WORDS 1024U
#define BOARD_A_ACQUISITION_STACK_WORDS 512U
#define BOARD_A_CONFIG_STACK_WORDS 512U
#define BOARD_A_STORAGE_STACK_WORDS 1024U
#define BOARD_A_IDLE_STACK_WORDS 128U
#define BOARD_A_LOG_PERIOD_US 5000000ULL
#define BOARD_A_MAX_WAIT_MS 1000U
#define BOARD_A_MONOTONIC_MAX_GAP_US 60000000U

#define BOARD_A_USART2_PREEMPTION_PRIORITY 5U

_Static_assert(configPRIO_BITS == 4U, "board A expects four NVIC priority bits");
_Static_assert(configTICK_RATE_HZ == 1000U, "board A expects a 1 kHz tick");
_Static_assert(BOARD_A_ACQUISITION_TASK_PRIORITY < configMAX_PRIORITIES,
               "DHT11 acquisition priority must be valid");
_Static_assert(BOARD_A_USART2_PREEMPTION_PRIORITY ==
                   configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY,
               "USART2 priority must be at or below the RTOS syscall limit");

typedef struct {
  uint8_t byte;
  uint32_t timestamp_us;
  uint32_t flags;
} board_a_rx_event_t;

typedef struct {
  volatile uint32_t task_ready_mask;
  volatile uint32_t comm_stack_min_words;
  volatile uint32_t acquisition_stack_min_words;
  volatile uint32_t config_stack_min_words;
  volatile uint32_t storage_stack_min_words;
  volatile uint32_t idle_stack_min_words;
  volatile uint32_t rx_queue_depth_max;
  volatile uint32_t rx_queue_drops;
  volatile uint32_t rx_continuity_errors;
  volatile uint32_t uart_error_flags;
  volatile uint32_t tx_timeouts;
  volatile uint32_t tx_completions;
  volatile uint32_t model_lock_max_us;
  volatile uint32_t schedule_late_max_us;
  volatile uint32_t schedule_start_late_max_us;
  volatile uint32_t schedule_start_count;
  volatile uint32_t monotonic_wrap_count;
  volatile uint32_t fault_flags;
  volatile uint32_t rx_queue_item_size;
} board_a_rtos_diag_t;

enum {
  BOARD_A_FAULT_ASSERT = 1U << 0,
  BOARD_A_FAULT_STACK_OVERFLOW = 1U << 1,
  BOARD_A_FAULT_TASK_CREATE = 1U << 2,
  BOARD_A_FAULT_SCHEDULER_RETURNED = 1U << 3,
  BOARD_A_FAULT_HARD_FAULT = 1U << 4,
  BOARD_A_FAULT_MEM_MANAGE = 1U << 5,
  BOARD_A_FAULT_BUS_FAULT = 1U << 6,
  BOARD_A_FAULT_USAGE_FAULT = 1U << 7,
  BOARD_A_FAULT_MONOTONIC_GAP = 1U << 8
};

volatile board_a_rtos_diag_t g_board_a_rtos_diag __attribute__((used));

static board_a_runtime_t g_runtime;
static board_a_monotonic_t g_monotonic;
static board_a_tx_t g_tx;
static board_a_rx_recovery_t g_rx_recovery;
static board_a_log_schedule_t g_log_schedule;
static board_a_sensor_manager_t g_sensor_manager;

static GPIO_TypeDef *const g_sensor_gpios[BOARD_A_SENSOR_COUNT] = {
  GPIOG, GPIOF, GPIOE
};
static const uint16_t g_sensor_pins[BOARD_A_SENSOR_COUNT] = {
  GPIO_Pin_9, GPIO_Pin_6, GPIO_Pin_5
};

static QueueHandle_t g_rx_queue;
static SemaphoreHandle_t g_model_mutex;
static TaskHandle_t g_comm_task;
static TaskHandle_t g_acquisition_task;
static TaskHandle_t g_config_task;
static TaskHandle_t g_storage_task;

static StaticQueue_t g_rx_queue_buffer;
static uint32_t g_rx_queue_storage[
    (BOARD_A_RX_QUEUE_CAPACITY * sizeof(board_a_rx_event_t) +
     sizeof(uint32_t) - 1U) /
    sizeof(uint32_t)] __attribute__((aligned(8)));

_Static_assert(sizeof(board_a_rx_event_t) == 12U,
               "board A RX event layout changed");
_Static_assert(sizeof(g_rx_queue_storage) >=
                   (BOARD_A_RX_QUEUE_CAPACITY * sizeof(board_a_rx_event_t)),
               "board A RX queue storage is undersized");
static StaticSemaphore_t g_model_mutex_buffer;
static StaticTask_t g_comm_task_buffer;
static StaticTask_t g_acquisition_task_buffer;
static StaticTask_t g_config_task_buffer;
static StaticTask_t g_storage_task_buffer;
static StaticTask_t g_idle_task_buffer;
static StackType_t g_comm_stack[BOARD_A_COMM_STACK_WORDS]
    __attribute__((aligned(8)));
static StackType_t g_acquisition_stack[BOARD_A_ACQUISITION_STACK_WORDS]
    __attribute__((aligned(8)));
static StackType_t g_config_stack[BOARD_A_CONFIG_STACK_WORDS]
    __attribute__((aligned(8)));
static StackType_t g_storage_stack[BOARD_A_STORAGE_STACK_WORDS]
    __attribute__((aligned(8)));
static StackType_t g_idle_stack[BOARD_A_IDLE_STACK_WORDS]
    __attribute__((aligned(8)));

static uint8_t g_response[MODBUS_RTU_MAX_ADU_SIZE];
static volatile uint32_t g_rx_fault_epoch;
static volatile uint32_t g_rx_fault_us;
static uint32_t g_rx_fault_epoch_seen;
static uint32_t g_model_lock_started_us;

void vPortSVCHandler(void);
void xPortPendSVHandler(void);
void xPortSysTickHandler(void);

void SVC_Handler(void)
{
  vPortSVCHandler();
}

void PendSV_Handler(void)
{
  xPortPendSVHandler();
}

void SysTick_Handler(void)
{
  xPortSysTickHandler();
}

static void board_a_rtos_fatal(uint32_t fault)
{
  g_board_a_rtos_diag.fault_flags |= fault;
  __disable_irq();
  for (;;) {
  }
}

void board_a_rtos_assert_failed(const char *file, int line)
{
  (void)file;
  (void)line;
  board_a_rtos_fatal(BOARD_A_FAULT_ASSERT);
}

void vApplicationStackOverflowHook(TaskHandle_t task, char *task_name)
{
  (void)task;
  (void)task_name;
  board_a_rtos_fatal(BOARD_A_FAULT_STACK_OVERFLOW);
}

void vApplicationIdleHook(void)
{
  g_board_a_rtos_diag.idle_stack_min_words =
      uxTaskGetStackHighWaterMark(NULL);
}

void vApplicationGetIdleTaskMemory(StaticTask_t **task_buffer,
                                   StackType_t **stack_buffer,
                                   uint32_t *stack_size)
{
  *task_buffer = &g_idle_task_buffer;
  *stack_buffer = g_idle_stack;
  *stack_size = BOARD_A_IDLE_STACK_WORDS;
}

